// รายชื่อนักเรียนแต่ละห้อง (แปลงจากใบรายชื่อ) — แก้ไขไฟล์นี้เมื่อมีนักเรียนย้ายเข้า/ออก
window.ROSTER = {
 "classes": [
  {
   "id": "1-1",
   "name": "ม.1/1",
   "level": 1,
   "advisors": [
    "นายเอกชัย ทองพุ่ม",
    "นางสาวเกตวริน ชัยมัง"
   ],
   "students": [
    {
     "no": 1,
     "code": "8529",
     "name": "เด็กชายชัชวาล ปริวันตา"
    },
    {
     "no": 2,
     "code": "8530",
     "name": "เด็กชายณัฐชนน ภูด่าน"
    },
    {
     "no": 3,
     "code": "8531",
     "name": "เด็กชายธนกฤต คุ้มภัย"
    },
    {
     "no": 4,
     "code": "8532",
     "name": "เด็กชายธนภัทร รัญญะวิทย์"
    },
    {
     "no": 5,
     "code": "8533",
     "name": "เด็กชายปฐมพร สีกุล"
    },
    {
     "no": 6,
     "code": "8534",
     "name": "เด็กชายภุชคินทร์ วรรณพงษ์"
    },
    {
     "no": 7,
     "code": "8535",
     "name": "เด็กชายภูตะวัน ภูพันนา"
    },
    {
     "no": 8,
     "code": "8536",
     "name": "เด็กชายรชต น้อยสนิท"
    },
    {
     "no": 9,
     "code": "8537",
     "name": "เด็กชายวิทยากร เกิดประโคน"
    },
    {
     "no": 10,
     "code": "8538",
     "name": "เด็กชายไอดิน เพชรศรีสุข"
    },
    {
     "no": 11,
     "code": "8539",
     "name": "เด็กหญิงกานต์รวี กองคำ"
    },
    {
     "no": 12,
     "code": "8541",
     "name": "เด็กหญิงชนนเนษฏ์ สายหยุด"
    },
    {
     "no": 13,
     "code": "8542",
     "name": "เด็กหญิงชยานันท์ ทองรัตน์"
    },
    {
     "no": 14,
     "code": "8543",
     "name": "เด็กหญิงญาดา รัตนสมบัติ"
    },
    {
     "no": 15,
     "code": "8544",
     "name": "เด็กหญิงณัฐญา กูบโคกกรวด"
    },
    {
     "no": 16,
     "code": "8545",
     "name": "เด็กหญิงทรงอัปสร อาตมาตสมบัติ"
    },
    {
     "no": 17,
     "code": "8546",
     "name": "เด็กหญิงนรินทร ชาฎา"
    },
    {
     "no": 18,
     "code": "8699",
     "name": "เด็กหญิงนวพร ชะนะบุญ"
    },
    {
     "no": 19,
     "code": "8617",
     "name": "เด็กหญิงนุดีณัฏฐ กล่ำพุทธา"
    },
    {
     "no": 20,
     "code": "8547",
     "name": "เด็กหญิงบงกช เกษหอม"
    },
    {
     "no": 21,
     "code": "8701",
     "name": "เด็กหญิงบุญอัญญา แก้วนาคูณ"
    },
    {
     "no": 22,
     "code": "8548",
     "name": "เด็กหญิงพัทธ์ธีรา ภูเงิน"
    },
    {
     "no": 23,
     "code": "8549",
     "name": "เด็กหญิงวิภาพร ทวีโยค"
    },
    {
     "no": 24,
     "code": "8550",
     "name": "เด็กหญิงศรีสกุล ไกยะราช"
    },
    {
     "no": 25,
     "code": "8551",
     "name": "เด็กหญิงสิริยากร มุงคุลแสน"
    },
    {
     "no": 26,
     "code": "8552",
     "name": "เด็กหญิงสุดารัตน์ สิทธิธรรม"
    },
    {
     "no": 27,
     "code": "8553",
     "name": "เด็กหญิงอรณิชา คำบึงกลาง"
    }
   ]
  },
  {
   "id": "1-2",
   "name": "ม.1/2",
   "level": 1,
   "advisors": [
    "นางสาวฐปนรรฆ์ สีสรร",
    "นางสาวปิ่นสุดา รมย์งาม"
   ],
   "students": [
    {
     "no": 1,
     "code": "8554",
     "name": "เด็กชายกระเดื่องเดช สุขศรี"
    },
    {
     "no": 2,
     "code": "8720",
     "name": "เด็กชายกฤติพงษ์ หิรัญพฤษ์"
    },
    {
     "no": 3,
     "code": "8555",
     "name": "เด็กชายกวินภพ โพธิ์โน"
    },
    {
     "no": 4,
     "code": "8556",
     "name": "เด็กชายเกียรติศักดิ์ เตี้ยคำ"
    },
    {
     "no": 5,
     "code": "8557",
     "name": "เด็กชายธนกฤต สุดแสวง"
    },
    {
     "no": 6,
     "code": "8558",
     "name": "เด็กชายธนาธรณ์ รอดบู่"
    },
    {
     "no": 7,
     "code": "8559",
     "name": "เด็กชายธวัชชัย สุวรรณใจ"
    },
    {
     "no": 8,
     "code": "8560",
     "name": "เด็กชายธัญเทพ ขันธรักษา"
    },
    {
     "no": 9,
     "code": "8561",
     "name": "เด็กชายบัญญวัต นามวิชัย"
    },
    {
     "no": 10,
     "code": "8562",
     "name": "เด็กชายพงษ์พันธ์ อ่อนน้อย"
    },
    {
     "no": 11,
     "code": "8563",
     "name": "เด็กชายพาโชค โสประดับ"
    },
    {
     "no": 12,
     "code": "8564",
     "name": "เด็กชายภูมิรพี ขวกเขียว"
    },
    {
     "no": 13,
     "code": "8565",
     "name": "เด็กชายเมธา พรมชาติ"
    },
    {
     "no": 14,
     "code": "8566",
     "name": "เด็กชายรัฐพล ธุระงาน"
    },
    {
     "no": 15,
     "code": "8567",
     "name": "เด็กชายวิทยา ปลาน้อย"
    },
    {
     "no": 16,
     "code": "8568",
     "name": "เด็กชายวินเซ็นต์ ออยเหย่าดง"
    },
    {
     "no": 17,
     "code": "8569",
     "name": "เด็กชายสหรัตน์ พันธุ์เดช"
    },
    {
     "no": 18,
     "code": "8570",
     "name": "เด็กชายอชิระ วิบูลอรรถ"
    },
    {
     "no": 19,
     "code": "8571",
     "name": "เด็กชายเอกอนันท์ คงทน"
    },
    {
     "no": 20,
     "code": "8572",
     "name": "เด็กหญิงกอข้าว สมแพง"
    },
    {
     "no": 21,
     "code": "8573",
     "name": "เด็กหญิงเขมจิรา ดวงสุมงคล"
    },
    {
     "no": 22,
     "code": "8574",
     "name": "เด็กหญิงจันทรรัตน์ จันเดช"
    },
    {
     "no": 23,
     "code": "8575",
     "name": "เด็กหญิงจุฑารัตน์ ยศมงคล"
    },
    {
     "no": 24,
     "code": "8576",
     "name": "เด็กหญิงชฎาภรณ์ ภูแข่งเดือน"
    },
    {
     "no": 25,
     "code": "8577",
     "name": "เด็กหญิงชลธิดา ชาบัว"
    },
    {
     "no": 26,
     "code": "8578",
     "name": "เด็กหญิงณัฐณิชา ภูเลื่อน"
    },
    {
     "no": 27,
     "code": "8697",
     "name": "เด็กหญิงทีปดา โพธิ์พล"
    },
    {
     "no": 28,
     "code": "8579",
     "name": "เด็กหญิงนภาทิพ อินทวิเศษ"
    },
    {
     "no": 29,
     "code": "8580",
     "name": "เด็กหญิงปณิตา คำพลแสน"
    },
    {
     "no": 30,
     "code": "8581",
     "name": "เด็กหญิงปภัสสร ป้อมหาร"
    },
    {
     "no": 31,
     "code": "8719",
     "name": "เด็กหญิงปริยาภัทร สีทาหล้า"
    },
    {
     "no": 32,
     "code": "8582",
     "name": "เด็กหญิงปัญญากร สอนเสนา"
    },
    {
     "no": 33,
     "code": "8583",
     "name": "เด็กหญิงพิชญทัญน์ นนนุศาสตร์"
    },
    {
     "no": 34,
     "code": "8585",
     "name": "เด็กหญิงภิญญาพัชญ์ แขวงสารคาม"
    },
    {
     "no": 35,
     "code": "8586",
     "name": "เด็กหญิงรวิสรา ทวีปชัย"
    },
    {
     "no": 36,
     "code": "8587",
     "name": "เด็กหญิงสุจิตราภา นาใจคง"
    },
    {
     "no": 37,
     "code": "8588",
     "name": "เด็กหญิงสุดาพันธ์ ขันจำปา"
    },
    {
     "no": 38,
     "code": "8589",
     "name": "เด็กหญิงอาทิตยา พันเดช"
    }
   ]
  },
  {
   "id": "1-3",
   "name": "ม.1/3",
   "level": 1,
   "advisors": [
    "นางสาวสุพัตรา โคตะวงศ์",
    "นางสาวนัฐยา จันทราศรี"
   ],
   "students": [
    {
     "no": 1,
     "code": "8590",
     "name": "เด็กชายกฤษกร คนชม"
    },
    {
     "no": 2,
     "code": "8591",
     "name": "เด็กชายเจษฎา ตางจงราช"
    },
    {
     "no": 3,
     "code": "8592",
     "name": "เด็กชายเจษฎา วิชาเดช"
    },
    {
     "no": 4,
     "code": "8593",
     "name": "เด็กชายฉลองชัย รัตนอนันต์"
    },
    {
     "no": 5,
     "code": "8594",
     "name": "เด็กชายชินวุฒ แจ้งอิ่ม"
    },
    {
     "no": 6,
     "code": "8595",
     "name": "เด็กชายฐิติพันธ์ ทองคำ"
    },
    {
     "no": 7,
     "code": "8596",
     "name": "เด็กชายณรงค์ชัย วิชาสวัสดิ์"
    },
    {
     "no": 8,
     "code": "8597",
     "name": "เด็กชายแท่งทอง สิงขรอาจ"
    },
    {
     "no": 9,
     "code": "8598",
     "name": "เด็กชายธนโชติ วิชาสวัสดิ์"
    },
    {
     "no": 10,
     "code": "8599",
     "name": "เด็กชายธนบดี โสระสา"
    },
    {
     "no": 11,
     "code": "8600",
     "name": "เด็กชายธีรยุทธ เขียวมี"
    },
    {
     "no": 12,
     "code": "8602",
     "name": "เด็กชายพรชัย วรรณศรี"
    },
    {
     "no": 13,
     "code": "8603",
     "name": "เด็กชายพีรพัฒน์ ม่วงผุย"
    },
    {
     "no": 14,
     "code": "8604",
     "name": "เด็กชายภูวนัย ไชยทองดี"
    },
    {
     "no": 15,
     "code": "8605",
     "name": "เด็กชายยศภัทร ดงสุกร"
    },
    {
     "no": 16,
     "code": "8606",
     "name": "เด็กชายรัชพงศ์ ปฏิรูปัง"
    },
    {
     "no": 17,
     "code": "8607",
     "name": "เด็กชายรัฐศาสตร์ แก้วมาตร"
    },
    {
     "no": 18,
     "code": "8608",
     "name": "เด็กชายวัชรพล พลช้าง"
    },
    {
     "no": 19,
     "code": "8609",
     "name": "เด็กชายวิทยาธร เหล่าเภา"
    },
    {
     "no": 20,
     "code": "8610",
     "name": "เด็กชายเศรษฐา คำพิลา"
    },
    {
     "no": 21,
     "code": "8611",
     "name": "เด็กหญิงกานต์มณี พงษ์ประเทศ"
    },
    {
     "no": 22,
     "code": "8612",
     "name": "เด็กหญิงแก้วตา แอ้นบุญมา"
    },
    {
     "no": 23,
     "code": "8613",
     "name": "เด็กหญิงณัฐสินี ถำวาปี"
    },
    {
     "no": 24,
     "code": "8614",
     "name": "เด็กหญิงธิดารัตน์ มหานาม"
    },
    {
     "no": 25,
     "code": "8615",
     "name": "เด็กหญิงนันทนา หมื่นราชา"
    },
    {
     "no": 26,
     "code": "8616",
     "name": "เด็กหญิงนุชจิรา ดียิ่ง"
    },
    {
     "no": 27,
     "code": "8618",
     "name": "เด็กหญิงบันฑิดา ผ่านแผ้ว"
    },
    {
     "no": 28,
     "code": "8696",
     "name": "เด็กหญิงพิชญธิดา เพ็ญภักดี"
    },
    {
     "no": 29,
     "code": "8698",
     "name": "เด็กหญิงฟ้าใส วิเท่ห์"
    },
    {
     "no": 30,
     "code": "8619",
     "name": "เด็กหญิงวันวิสาข์ ศิริโยธา"
    },
    {
     "no": 31,
     "code": "8620",
     "name": "เด็กหญิงศุภดา เที่ยงจิตร์"
    },
    {
     "no": 32,
     "code": "8622",
     "name": "เด็กหญิงสุทธิกานต์ อัศนียวงศ์"
    },
    {
     "no": 33,
     "code": "8623",
     "name": "เด็กหญิงสุมินญา นาใจคง"
    },
    {
     "no": 34,
     "code": "8624",
     "name": "เด็กหญิงอภิชญา พรมเมือง"
    },
    {
     "no": 35,
     "code": "8625",
     "name": "เด็กหญิงอุษมณี หงษ์ทองแต่ง"
    }
   ]
  },
  {
   "id": "1-4",
   "name": "ม.1/4",
   "level": 1,
   "advisors": [
    "นายธีรภัทร หลักทอง",
    "นางสาวอุทัยวดี เพิ่มขึ้น"
   ],
   "students": [
    {
     "no": 1,
     "code": "8703",
     "name": "เด็กชายจีรศักดิ์ จันหัวนา"
    },
    {
     "no": 2,
     "code": "8601",
     "name": "เด็กชายชาตรี พิมพากุล"
    },
    {
     "no": 3,
     "code": "8626",
     "name": "เด็กชายฐิติโชติ สุขทวี"
    },
    {
     "no": 4,
     "code": "8627",
     "name": "เด็กชายฐิติวัชร์ ตลับแก้ว"
    },
    {
     "no": 5,
     "code": "8628",
     "name": "เด็กชายเดชาธร ชัยมาตย์"
    },
    {
     "no": 6,
     "code": "8700",
     "name": "เด็กชายติณณภพ เหม็นพูล"
    },
    {
     "no": 7,
     "code": "8629",
     "name": "เด็กชายธนกฤติ จิตรจวง"
    },
    {
     "no": 8,
     "code": "8630",
     "name": "เด็กชายธนพล วงค์แก้ว"
    },
    {
     "no": 9,
     "code": "8631",
     "name": "เด็กชายธนาคาร สายบุญจันทร์"
    },
    {
     "no": 10,
     "code": "8706",
     "name": "เด็กชายธวัตชัย นครกัณฑ์"
    },
    {
     "no": 11,
     "code": "8632",
     "name": "เด็กชายธีรพล ติดวงษา"
    },
    {
     "no": 12,
     "code": "8633",
     "name": "เด็กชายธีรภัทร สุโพธิ์"
    },
    {
     "no": 13,
     "code": "8634",
     "name": "เด็กชายนวพล สุพร"
    },
    {
     "no": 14,
     "code": "8635",
     "name": "เด็กชายพิมาย ศรีภักดี"
    },
    {
     "no": 15,
     "code": "8636",
     "name": "เด็กชายพีรพัฒน์ วังทะพันธ์"
    },
    {
     "no": 16,
     "code": "8637",
     "name": "เด็กชายภัทรกร คำวงศา"
    },
    {
     "no": 17,
     "code": "8638",
     "name": "เด็กชายวรชิต แสนโคตร"
    },
    {
     "no": 18,
     "code": "8639",
     "name": "เด็กชายวัชรพงศ์ สิงห์ชอม"
    },
    {
     "no": 19,
     "code": "8640",
     "name": "เด็กชายสุรชัย โคตรประทุม"
    },
    {
     "no": 20,
     "code": "8641",
     "name": "เด็กชายสุระเดช ทองกรม"
    },
    {
     "no": 21,
     "code": "8642",
     "name": "เด็กชายสุริยา พิมพ์ดา"
    },
    {
     "no": 22,
     "code": "8643",
     "name": "เด็กชายอภิวิชญ์ พันธ์ขาม"
    },
    {
     "no": 23,
     "code": "8644",
     "name": "เด็กชายอัชชนะ หมื่นทะยศ"
    },
    {
     "no": 24,
     "code": "8645",
     "name": "เด็กหญิงกนกพร โสกัณฑัต"
    },
    {
     "no": 25,
     "code": "8646",
     "name": "เด็กหญิงกมลชนก แซ่เซียว"
    },
    {
     "no": 26,
     "code": "8647",
     "name": "เด็กหญิงกมลทิพย์ วินิจ"
    },
    {
     "no": 27,
     "code": "8648",
     "name": "เด็กหญิงกมลลักษณ์ บัวหลวง"
    },
    {
     "no": 28,
     "code": "8649",
     "name": "เด็กหญิงกรรณิกา ดวงภักใต้"
    },
    {
     "no": 29,
     "code": "8650",
     "name": "เด็กหญิงกัญญารัตน์ หงษ์ศรีทอง"
    },
    {
     "no": 30,
     "code": "8651",
     "name": "เด็กหญิงณัฐกาน ดอนทอง"
    },
    {
     "no": 31,
     "code": "8652",
     "name": "เด็กหญิงณัฐธยาน์ ทองทับ"
    },
    {
     "no": 32,
     "code": "8654",
     "name": "เด็กหญิงนฤมล โคสะคง"
    },
    {
     "no": 33,
     "code": "8702",
     "name": "เด็กหญิงปภาวี คำโห"
    },
    {
     "no": 34,
     "code": "8656",
     "name": "เด็กหญิงพรทิพย์ ใจเสมอ"
    },
    {
     "no": 35,
     "code": "8657",
     "name": "เด็กหญิงลักคณา มาตะรักษ์"
    },
    {
     "no": 36,
     "code": "8658",
     "name": "เด็กหญิงวิมลรัตน์ พันเดช"
    },
    {
     "no": 37,
     "code": "8659",
     "name": "เด็กหญิงสุพรรษา ศรีผาย"
    },
    {
     "no": 38,
     "code": "8660",
     "name": "เด็กหญิงสุภัคธิดา สุดตา"
    }
   ]
  },
  {
   "id": "2-4",
   "name": "ม.2/4",
   "level": 2,
   "advisors": [
    "นางสาวจุฑารัตน์ ชานุชิต",
    "นายพงศกร ดรโคตร์กอก"
   ],
   "students": [
    {
     "no": 1,
     "code": "8402",
     "name": "เด็กชายกรวิชญ์ ปานเปลี่ยน"
    },
    {
     "no": 2,
     "code": "8403",
     "name": "เด็กชายกิตติศักดิ์ เดชไชยวงศ์"
    },
    {
     "no": 3,
     "code": "8404",
     "name": "เด็กชายจักรพันธ์ แก้วประทุม"
    },
    {
     "no": 4,
     "code": "8405",
     "name": "เด็กชายจิรายุ ตวงไธสง"
    },
    {
     "no": 5,
     "code": "8406",
     "name": "เด็กชายจีระพัฒน์ พุทธมี"
    },
    {
     "no": 6,
     "code": "8407",
     "name": "เด็กชายเจคอบ ไวท์"
    },
    {
     "no": 7,
     "code": "8408",
     "name": "เด็กชายชนะพล พรมวงษ์"
    },
    {
     "no": 8,
     "code": "8409",
     "name": "เด็กชายณัฐยศ วัดเวียงคำ"
    },
    {
     "no": 9,
     "code": "8410",
     "name": "เด็กชายเทวารัณย์ จันทร์ศรี"
    },
    {
     "no": 10,
     "code": "8526",
     "name": "เด็กชายธนภัทร วงษ์สีหา"
    },
    {
     "no": 11,
     "code": "8411",
     "name": "เด็กชายธีรยุทธ แก้วประทุม"
    },
    {
     "no": 12,
     "code": "8412",
     "name": "เด็กชายนครรินทร์ พ่อพิลา"
    },
    {
     "no": 13,
     "code": "8523",
     "name": "เด็กชายปัญญา สาระบัว"
    },
    {
     "no": 14,
     "code": "8724",
     "name": "เด็กชายพายุพัฒน์ ฝ่ายจารี"
    },
    {
     "no": 15,
     "code": "8414",
     "name": "เด็กชายพีระพัฒน์ เจริญไทย"
    },
    {
     "no": 16,
     "code": "8415",
     "name": "เด็กชายมนัญชัย ก้อนธิงาม"
    },
    {
     "no": 17,
     "code": "8416",
     "name": "เด็กชายศักดิธัช จันทะสงเคราะห์"
    },
    {
     "no": 18,
     "code": "8418",
     "name": "เด็กชายศุภนัฐ เสนาพันธ์"
    },
    {
     "no": 19,
     "code": "8417",
     "name": "เด็กชายสุภกิตติ์ คำพูล"
    },
    {
     "no": 20,
     "code": "8419",
     "name": "เด็กหญิงกัญญา อุตละศรี"
    },
    {
     "no": 21,
     "code": "8422",
     "name": "เด็กหญิงจิราวรรณ แก้วประทุม"
    },
    {
     "no": 22,
     "code": "8423",
     "name": "เด็กหญิงชฎาทิพย์ แสนสีมมา"
    },
    {
     "no": 23,
     "code": "8424",
     "name": "เด็กหญิงณิฤมล ศรีตะลา"
    },
    {
     "no": 24,
     "code": "8487",
     "name": "เด็กหญิงนิษฐกานต์ จันทร์เสนา"
    },
    {
     "no": 25,
     "code": "8515",
     "name": "เด็กหญิงปณิดา เหล็กดี"
    },
    {
     "no": 26,
     "code": "8425",
     "name": "เด็กหญิงปรีญากมล สมพิทักษ์"
    },
    {
     "no": 27,
     "code": "8426",
     "name": "เด็กหญิงพลอยไพลิน พรมผิว"
    },
    {
     "no": 28,
     "code": "8427",
     "name": "เด็กหญิงพัณณิตา ข่าทิพาที"
    },
    {
     "no": 29,
     "code": "8428",
     "name": "เด็กหญิงรัชวิน ต้นสาย"
    },
    {
     "no": 30,
     "code": "8429",
     "name": "เด็กหญิงวริศรา ปักษา"
    },
    {
     "no": 31,
     "code": "8488",
     "name": "เด็กหญิงศศิมา ชาฎา"
    },
    {
     "no": 32,
     "code": "8430",
     "name": "เด็กหญิงศิวปรียา พรทอง"
    },
    {
     "no": 33,
     "code": "8432",
     "name": "เด็กหญิงหทัยพัชฑรา ป่าสะกิจ"
    },
    {
     "no": 34,
     "code": "8433",
     "name": "เด็กหญิงอนัญญา ทาสีแสง"
    },
    {
     "no": 35,
     "code": "8434",
     "name": "เด็กหญิงอรชา ทิดทะโต"
    },
    {
     "no": 36,
     "code": "8435",
     "name": "เด็กหญิงอุษณียาภรณ์ รัตเพ็ชร"
    }
   ]
  },
  {
   "id": "3-1",
   "name": "ม.3/1",
   "level": 3,
   "advisors": [
    "นางสาวพักตร์พิริยา ศรีสาร",
    "นางเทวี นางาม",
    "นางยุพิน ศรีเรือง"
   ],
   "students": [
    {
     "no": 1,
     "code": "8099",
     "name": "เด็กชายเกียรติภิรมย์ ภิรมย์รักษ์"
    },
    {
     "no": 2,
     "code": "8100",
     "name": "เด็กชายคมสันต์ งามขำ"
    },
    {
     "no": 3,
     "code": "8101",
     "name": "นายจิมมี่ เพชรศรีสุข"
    },
    {
     "no": 4,
     "code": "8240",
     "name": "เด็กชายชัยอนันต์ มูลศิติ"
    },
    {
     "no": 5,
     "code": "8102",
     "name": "เด็กชายณัชชานนท์ จิตจักร"
    },
    {
     "no": 6,
     "code": "8244",
     "name": "เด็กชายณัฐพงษ์ นาใจคง"
    },
    {
     "no": 7,
     "code": "8103",
     "name": "เด็กชายดนุเดช ชาตะเคน"
    },
    {
     "no": 8,
     "code": "8104",
     "name": "เด็กชายเตชิต พลประถม"
    },
    {
     "no": 9,
     "code": "8259",
     "name": "เด็กชายธีรภัทร พรมกุง"
    },
    {
     "no": 10,
     "code": "8105",
     "name": "เด็กชายนวพล คำจินดา"
    },
    {
     "no": 11,
     "code": "8106",
     "name": "เด็กชายบุญเกิด ไทยเสถียน"
    },
    {
     "no": 12,
     "code": "8108",
     "name": "เด็กชายพิทยพงษ์ โสขำ"
    },
    {
     "no": 13,
     "code": "8109",
     "name": "เด็กชายโพธิวัฒน์ ไชยทองดี"
    },
    {
     "no": 14,
     "code": "8110",
     "name": "เด็กชายภาณุพงศ์ ธีระยุทธ"
    },
    {
     "no": 15,
     "code": "8111",
     "name": "เด็กชายศตวรรษ สิงห์คำ"
    },
    {
     "no": 16,
     "code": "8238",
     "name": "เด็กชายอนันต์ชัย มูลศิติ"
    },
    {
     "no": 17,
     "code": "8114",
     "name": "เด็กหญิงกัญญาณัฐ วงษ์ศรีแก้ว"
    },
    {
     "no": 18,
     "code": "8115",
     "name": "เด็กหญิงกันยา สุวรรณเพ็ง"
    },
    {
     "no": 19,
     "code": "8116",
     "name": "เด็กหญิงจีรัตน์ รินทะรักษ์"
    },
    {
     "no": 20,
     "code": "8117",
     "name": "เด็กหญิงดาราวดี อ่อนศรีแก้ว"
    },
    {
     "no": 21,
     "code": "8118",
     "name": "เด็กหญิงทิพวรรณ สิงห์สา"
    },
    {
     "no": 22,
     "code": "8119",
     "name": "เด็กหญิงธนาภา วิสัยหมู"
    },
    {
     "no": 23,
     "code": "8120",
     "name": "เด็กหญิงนันทิชา เผ่าหอม"
    },
    {
     "no": 24,
     "code": "8121",
     "name": "เด็กหญิงนิตยา อุ่นใจ"
    },
    {
     "no": 25,
     "code": "8122",
     "name": "เด็กหญิงนุชธิดา สอนสำโรง"
    },
    {
     "no": 26,
     "code": "8123",
     "name": "เด็กหญิงปริยฉัตร ศึกสงคราม"
    },
    {
     "no": 27,
     "code": "8492",
     "name": "เด็กหญิงปิยะมาศ ทองรัตน์"
    },
    {
     "no": 28,
     "code": "8125",
     "name": "เด็กหญิงพัชดาภา ภูมิธิ"
    },
    {
     "no": 29,
     "code": "8126",
     "name": "เด็กหญิงเพ็ญพักตร์ ภูจำปี"
    },
    {
     "no": 30,
     "code": "8127",
     "name": "เด็กหญิงวนิดา ดอนน้อยหน่า"
    },
    {
     "no": 31,
     "code": "8128",
     "name": "เด็กหญิงวิชุดา ศรีพุทธา"
    },
    {
     "no": 32,
     "code": "8129",
     "name": "เด็กหญิงวิภานันท์ วันทรวง"
    },
    {
     "no": 33,
     "code": "8130",
     "name": "เด็กหญิงวิสาสินี กองกุล"
    },
    {
     "no": 34,
     "code": "8131",
     "name": "เด็กหญิงวีรวรรณ สุทธิสุข"
    },
    {
     "no": 35,
     "code": "8709",
     "name": "เด็กหญิงสุมินชา นาใจคง"
    },
    {
     "no": 36,
     "code": "8132",
     "name": "เด็กหญิงอรัญญา คำจินดา"
    }
   ]
  },
  {
   "id": "3-4",
   "name": "ม.3/4",
   "level": 3,
   "advisors": [
    "นายระพีพัฒน์ กลัดกันแสง"
   ],
   "students": [
    {
     "no": 1,
     "code": "8248",
     "name": "เด็กชายชัยกิจ จรุงพันธ์"
    },
    {
     "no": 2,
     "code": "8196",
     "name": "เด็กชายเชิดตระกูล ค้าข้าว"
    },
    {
     "no": 3,
     "code": "8197",
     "name": "เด็กชายณัฐนนท์ วิเชียร"
    },
    {
     "no": 4,
     "code": "8198",
     "name": "เด็กชายณัฐพล ภูผาดวง"
    },
    {
     "no": 5,
     "code": "8263",
     "name": "เด็กชายณัฐวีย์ แหลมฉลาด"
    },
    {
     "no": 6,
     "code": "8199",
     "name": "เด็กชายเดชาธร ผาแก้ว"
    },
    {
     "no": 7,
     "code": "8200",
     "name": "เด็กชายธีธัส สุนทรวัฒน์"
    },
    {
     "no": 8,
     "code": "8201",
     "name": "เด็กชายธีร์ธวัช พลีพรม"
    },
    {
     "no": 9,
     "code": "8202",
     "name": "เด็กชายนดล สีมา"
    },
    {
     "no": 10,
     "code": "8203",
     "name": "เด็กชายประสิทธิ์ ประวรรณา"
    },
    {
     "no": 11,
     "code": "8712",
     "name": "เด็กชายภูตะวัน คำแก้ว"
    },
    {
     "no": 12,
     "code": "8260",
     "name": "เด็กชายภูมิเดช โพธิ์ทอง"
    },
    {
     "no": 13,
     "code": "8204",
     "name": "เด็กชายรชต บุญมาศ"
    },
    {
     "no": 14,
     "code": "8205",
     "name": "นายวุฒิไกร ทองโคตร"
    },
    {
     "no": 15,
     "code": "8206",
     "name": "เด็กชายศิวกร ก้วเหล็ก"
    },
    {
     "no": 16,
     "code": "8207",
     "name": "เด็กชายสรยุทธ วงค์กุล"
    },
    {
     "no": 17,
     "code": "8247",
     "name": "เด็กชายสรวิชญ์ เที่ยงผดุง"
    },
    {
     "no": 18,
     "code": "8208",
     "name": "เด็กชายอนุชา องค์กลาง"
    },
    {
     "no": 19,
     "code": "8210",
     "name": "เด็กชายอนุพงศ์ งิ้วลาย"
    },
    {
     "no": 20,
     "code": "8211",
     "name": "เด็กชายอนุวัฒน์ ลมหวล"
    },
    {
     "no": 21,
     "code": "8212",
     "name": "เด็กชายอภิรักษ์ เกตุพันธ์"
    },
    {
     "no": 22,
     "code": "8241",
     "name": "เด็กชายอัครชัย สังหา"
    },
    {
     "no": 23,
     "code": "8257",
     "name": "เด็กหญิงกมลชนก อินเลี้ยง"
    },
    {
     "no": 24,
     "code": "8213",
     "name": "เด็กหญิงกรรณิกา นาไชย"
    },
    {
     "no": 25,
     "code": "8514",
     "name": "นางสาวณัชชา วันนิตย์"
    },
    {
     "no": 26,
     "code": "8185",
     "name": "เด็กหญิงณัฏฐณิชา เส้นเศษ"
    },
    {
     "no": 27,
     "code": "8152",
     "name": "เด็กหญิงณัฏฐิกา คำพิลา"
    },
    {
     "no": 28,
     "code": "8214",
     "name": "เด็กหญิงนิติยากรณ์ สุวรรณคำ"
    },
    {
     "no": 29,
     "code": "8261",
     "name": "เด็กหญิงปนิดา น้อยแก้ว"
    },
    {
     "no": 30,
     "code": "8215",
     "name": "เด็กหญิงปภิญญา ไวสุวรรณ์"
    },
    {
     "no": 31,
     "code": "8218",
     "name": "เด็กหญิงฤทัยรัตน์ ทองคำกรม"
    },
    {
     "no": 32,
     "code": "8220",
     "name": "เด็กหญิงวิภาวรรณ ประดับเพชร"
    },
    {
     "no": 33,
     "code": "8219",
     "name": "เด็กหญิงศิรภัสสร พลประถม"
    },
    {
     "no": 34,
     "code": "8221",
     "name": "เด็กหญิงอภิญญา ทองคำปลิว"
    },
    {
     "no": 35,
     "code": "8222",
     "name": "เด็กหญิงอันริสา ดีพลโต"
    },
    {
     "no": 36,
     "code": "8518",
     "name": "เด็กหญิงฮุ่ย จิ้ง ออย"
    }
   ]
  },
  {
   "id": "6-1",
   "name": "ม.6/1",
   "level": 6,
   "advisors": [
    "นายชาติสุพงษ์ ภูลาด",
    "นางสาวอัญชลี พันธุ์แวงมนต์"
   ],
   "students": [
    {
     "no": 1,
     "code": "7506",
     "name": "นายกฤษดา นาไชย"
    },
    {
     "no": 2,
     "code": "7507",
     "name": "นายกิตติพันธ์ ทองจันทร์"
    },
    {
     "no": 3,
     "code": "7509",
     "name": "นายคุนญาฤทธิ์ ดีษะเกตุ"
    },
    {
     "no": 4,
     "code": "7544",
     "name": "นายณัทพงษ์ เตรัมย์"
    },
    {
     "no": 5,
     "code": "7865",
     "name": "นายทวีทรัพย์ พลเชียงสา"
    },
    {
     "no": 6,
     "code": "7512",
     "name": "นายธิติสรณ์ คำสีโห"
    },
    {
     "no": 7,
     "code": "7513",
     "name": "นายนนท์กวี หอมทอง"
    },
    {
     "no": 8,
     "code": "7648",
     "name": "นายนันทชัย บุตรโคตร"
    },
    {
     "no": 9,
     "code": "7514",
     "name": "นายพิริยากร สอนสำโรง"
    },
    {
     "no": 10,
     "code": "7548",
     "name": "นายพีรเวช พิศอ่อน"
    },
    {
     "no": 11,
     "code": "7515",
     "name": "นายพุฒิเมธ กินารักษ์"
    },
    {
     "no": 12,
     "code": "7554",
     "name": "นายสุภชัย ปะติโก"
    },
    {
     "no": 13,
     "code": "7553",
     "name": "นายเอกสิทธิ์ คมขำ"
    },
    {
     "no": 14,
     "code": "7517",
     "name": "นางสาวกนกวรรณ ชูกลิ่น"
    },
    {
     "no": 15,
     "code": "7518",
     "name": "นางสาวกนกอร ศรีวงษ์"
    },
    {
     "no": 16,
     "code": "7519",
     "name": "นางสาวกมลทิพย์ ช่วยพันธ์"
    },
    {
     "no": 17,
     "code": "7523",
     "name": "นางสาวชนิดาภา จำกอง"
    },
    {
     "no": 18,
     "code": "7558",
     "name": "นางสาวชุติมา ไชยลือชา"
    },
    {
     "no": 19,
     "code": "7528",
     "name": "นางสาวเนตรนภา สินชัย"
    },
    {
     "no": 20,
     "code": "7563",
     "name": "นางสาวพัชรินทร์ สายสีมา"
    },
    {
     "no": 21,
     "code": "7531",
     "name": "นางสาวพิมพกานต์ พันธ์ขาว"
    },
    {
     "no": 22,
     "code": "8223",
     "name": "นางสาวพิมพิลัย บุญเชิด"
    },
    {
     "no": 23,
     "code": "7534",
     "name": "นางสาววันดี สงคราม"
    },
    {
     "no": 24,
     "code": "7536",
     "name": "นางสาวศรัญยา คมขำ"
    },
    {
     "no": 25,
     "code": "7606",
     "name": "นางสาวศศิวิภา เหล่าจันอ้น"
    },
    {
     "no": 26,
     "code": "8224",
     "name": "นางสาวศิริพร บัวทิพย์"
    },
    {
     "no": 27,
     "code": "7540",
     "name": "นางสาวไอรดา ศรีพุทธา"
    },
    {
     "no": 28,
     "code": "7576",
     "name": "นางสาวไอวาลิน นุชิต"
    }
   ]
  },
  {
   "id": "6-2",
   "name": "ม.6/2",
   "level": 6,
   "advisors": [
    "นายพิพัฒพงษ์ สุวรรณโสภา",
    "นายธนากร จันดา"
   ],
   "students": [
    {
     "no": 1,
     "code": "7542",
     "name": "นายเจษฎากร พรมวิหาร"
    },
    {
     "no": 2,
     "code": "7616",
     "name": "นายณัฐภูมิ อินเพชร"
    },
    {
     "no": 3,
     "code": "8232",
     "name": "นายณัฐวัฒน์ สีลาพัฒน์"
    },
    {
     "no": 4,
     "code": "7545",
     "name": "นายเตชินท์ สีลวัน"
    },
    {
     "no": 5,
     "code": "8227",
     "name": "นายบุญมี ใจตรง"
    },
    {
     "no": 6,
     "code": "7581",
     "name": "นายพสุธร ภาไชย"
    },
    {
     "no": 7,
     "code": "7549",
     "name": "นายพูนทรัพย์ ทองธูป"
    },
    {
     "no": 8,
     "code": "7584",
     "name": "นายภานุวัฒน์ บุญพร้อม"
    },
    {
     "no": 9,
     "code": "7585",
     "name": "นายภานุวิชญ์ วงค์ม่วย"
    },
    {
     "no": 10,
     "code": "7623",
     "name": "นายฤทธิชัย หวังทะกลาง"
    },
    {
     "no": 11,
     "code": "7880",
     "name": "นายสุรเชษฐ ชูศรีโสม"
    },
    {
     "no": 12,
     "code": "7552",
     "name": "นายอิศรา วงษ์นู"
    },
    {
     "no": 13,
     "code": "7520",
     "name": "นางสาวกมลวรรณ สุธารัตน์"
    },
    {
     "no": 14,
     "code": "7633",
     "name": "นางสาวชลธิชา เหล่าทองสาร"
    },
    {
     "no": 15,
     "code": "7557",
     "name": "นางสาวชลลดา นาถาบำรุง"
    },
    {
     "no": 16,
     "code": "7598",
     "name": "นางสาวฐิติมา สีทา"
    },
    {
     "no": 17,
     "code": "8229",
     "name": "นางสาวฑิฆัมพร ประสาน"
    },
    {
     "no": 18,
     "code": "7597",
     "name": "นางสาวธมลวรรณ พรัดพรม"
    },
    {
     "no": 19,
     "code": "8291",
     "name": "นางสาวปภัสรา ดวงจันทร์"
    },
    {
     "no": 20,
     "code": "7561",
     "name": "นางสาวปาริตา คุณเอื้ออารี"
    },
    {
     "no": 21,
     "code": "7530",
     "name": "นางสาวพรนภา นามแสง"
    },
    {
     "no": 22,
     "code": "7562",
     "name": "นางสาวพัชรา สายสีมา"
    },
    {
     "no": 23,
     "code": "8230",
     "name": "นางสาวพิชชาภา สิงห์ขอนอาจ"
    },
    {
     "no": 24,
     "code": "8231",
     "name": "นางสาวภนิดา ธงวาด"
    },
    {
     "no": 25,
     "code": "7565",
     "name": "นางสาววราพร ปฏิรูปัง"
    },
    {
     "no": 26,
     "code": "7642",
     "name": "นางสาวศศิขวัญ เชิดชู"
    },
    {
     "no": 27,
     "code": "7537",
     "name": "นางสาวศศินา แก้วกัลยา"
    },
    {
     "no": 28,
     "code": "7643",
     "name": "นางสาวศิริรัตน์ รินทะรักษ์"
    },
    {
     "no": 29,
     "code": "7570",
     "name": "นางสาวสุชานรี ศรีอาด"
    },
    {
     "no": 30,
     "code": "7572",
     "name": "นางสาวอรนุช หันดี"
    },
    {
     "no": 31,
     "code": "7571",
     "name": "นางสาวอรอนงค์ ชัยสงค์"
    },
    {
     "no": 32,
     "code": "7649",
     "name": "นางสาวอรัญญา เหล่าภู"
    },
    {
     "no": 33,
     "code": "7538",
     "name": "นางสาวอัญชณาพร หลักคำพันธ์"
    },
    {
     "no": 34,
     "code": "7575",
     "name": "นางสาวอารยา บัวเขียว"
    },
    {
     "no": 35,
     "code": "7539",
     "name": "นางสาวอินธุอร สุโพธิ์คำ"
    }
   ]
  },
  {
   "id": "6-3",
   "name": "ม.6/3",
   "level": 6,
   "advisors": [
    "นางนีรนุช มะยุระยอด",
    "นายนฤเบศ บุญกว้าง"
   ],
   "students": [
    {
     "no": 1,
     "code": "8233",
     "name": "นายเกียรติภูมิ สิงหานิล"
    },
    {
     "no": 2,
     "code": "8287",
     "name": "นายบูรณ์พิภพ เขตบุญสม"
    },
    {
     "no": 3,
     "code": "8524",
     "name": "นายพลวัฒน์ แพงไธสง"
    },
    {
     "no": 4,
     "code": "7587",
     "name": "นายวัชระวัฒน์ ขันจำปา"
    },
    {
     "no": 5,
     "code": "7588",
     "name": "นายศรายุธ โทรัตน์"
    },
    {
     "no": 6,
     "code": "8286",
     "name": "นายสิทธา สุขแจ่ม"
    },
    {
     "no": 7,
     "code": "8285",
     "name": "นางสาวกชกร บุญเพ็ง"
    },
    {
     "no": 8,
     "code": "7594",
     "name": "นางสาวกัญญาวีร์ หมื่นรอด"
    },
    {
     "no": 9,
     "code": "7555",
     "name": "นางสาวขวัญจิรา สุนาคราช"
    },
    {
     "no": 10,
     "code": "7595",
     "name": "นางสาวชลดา ไสโยธา"
    },
    {
     "no": 11,
     "code": "7596",
     "name": "นางสาวชาลิสา บุญเสนา"
    },
    {
     "no": 12,
     "code": "7634",
     "name": "นางสาวธัญพิมล วันนิตย์"
    },
    {
     "no": 13,
     "code": "8281",
     "name": "นางสาวนภัสร ช่วยจันทร์"
    },
    {
     "no": 14,
     "code": "8298",
     "name": "นางสาวนภัสสร ดรปัญญา"
    },
    {
     "no": 15,
     "code": "8282",
     "name": "นางสาวพรทิพา อามาตมนตรี"
    },
    {
     "no": 16,
     "code": "7601",
     "name": "นางสาวพรนภา คำสีโห"
    },
    {
     "no": 17,
     "code": "7638",
     "name": "นางสาวพรรณวดี ทับอาสา"
    },
    {
     "no": 18,
     "code": "7644",
     "name": "นางสาวสุจิตรา ลมหวน"
    },
    {
     "no": 19,
     "code": "7612",
     "name": "นางสาวอธิพร ป้องคำสิงห์"
    }
   ]
  }
 ]
};
